FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/uspi_reg.h
#define USPI_BRGEN_TMCNTEN_Pos       ( 4 )                                                 /*!< USPI_T::BRGEN: TMCNTEN Position        */
#define USPI_BRGEN_TMCNTEN_Msk       ( 0x1ul << USPI_BRGEN_TMCNTEN_Pos )                   /*!< USPI_T::BRGEN: TMCNTEN Mask            */

#define USPI_BRGEN_TMCNTSRC_Pos      ( 5 )                                                 /*!< USPI_T::BRGEN: TMCNTSRC Position       */
#define USPI_BRGEN_TMCNTSRC_Msk      ( 0x1ul << USPI_BRGEN_TMCNTSRC_Pos )                  /*!< USPI_T::BRGEN: TMCNTSRC Mask           */

#define USPI_BRGEN_CLKDIV_Pos        ( 16 )                                                /*!< USPI_T::BRGEN: CLKDIV Position         */
#define USPI_BRGEN_CLKDIV_Msk        ( 0x3fful << USPI_BRGEN_CLKDIV_Pos )                  /*!< USPI_T::BRGEN: CLKDIV Mask             */

#define USPI_DATIN0_SYNCSEL_Pos      ( 0 )                                                 /*!< USPI_T::DATIN0: SYNCSEL Position       */
#define USPI_DATIN0_SYNCSEL_Msk      ( 0x1ul << USPI_DATIN0_SYNCSEL_Pos )                  /*!< USPI_T::DATIN0: SYNCSEL Mask           */

#define USPI_DATIN0_ININV_Pos        ( 2 )                                                 /*!< USPI_T::DATIN0: ININV Position         */
#define USPI_DATIN0_ININV_Msk        ( 0x1ul << USPI_DATIN0_ININV_Pos )                    /*!< USPI_T::DATIN0: ININV Mask             */

#define USPI_CTLIN0_SYNCSEL_Pos      ( 0 )                                                 /*!< USPI_T::CTLIN0: SYNCSEL Position       */
#define USPI_CTLIN0_SYNCSEL_Msk      ( 0x1ul << USPI_CTLIN0_SYNCSEL_Pos )                  /*!< USPI_T::CTLIN0: SYNCSEL Mask           */

#define USPI_CTLIN0_ININV_Pos        ( 2 )                                                 /*!< USPI_T::CTLIN0: ININV Position         */
#define USPI_CTLIN0_ININV_Msk        ( 0x1ul << USPI_CTLIN0_ININV_Pos )                    /*!< USPI_T::CTLIN0: ININV Mask             */

#define USPI_CLKIN_SYNCSEL_Pos       ( 0 )                                                 /*!< USPI_T::CLKIN: SYNCSEL Position        */
#define USPI_CLKIN_SYNCSEL_Msk       ( 0x1ul << USPI_CLKIN_SYNCSEL_Pos )                   /*!< USPI_T::CLKIN: SYNCSEL Mask            */

#define USPI_LINECTL_LSB_Pos         ( 0 )                                                 /*!< USPI_T::LINECTL: LSB Position          */
#define USPI_LINECTL_LSB_Msk         ( 0x1ul << USPI_LINECTL_LSB_Pos )                     /*!< USPI_T::LINECTL: LSB Mask              */

#define USPI_LINECTL_DATOINV_Pos     ( 5 )                                                 /*!< USPI_T::LINECTL: DATOINV Position      */
#define USPI_LINECTL_DATOINV_Msk     ( 0x1ul << USPI_LINECTL_DATOINV_Pos )                 /*!< USPI_T::LINECTL: DATOINV Mask          */

#define USPI_LINECTL_CTLOINV_Pos     ( 7 )                                                 /*!< USPI_T::LINECTL: CTLOINV Position      */
#define USPI_LINECTL_CTLOINV_Msk     ( 0x1ul << USPI_LINECTL_CTLOINV_Pos )                 /*!< USPI_T::LINECTL: CTLOINV Mask          */

#define USPI_LINECTL_DWIDTH_Pos      ( 8 )                                                 /*!< USPI_T::LINECTL: DWIDTH Position       */
#define USPI_LINECTL_DWIDTH_Msk      ( 0xful << USPI_LINECTL_DWIDTH_Pos )                  /*!< USPI_T::LINECTL: DWIDTH Mask           */

#define USPI_TXDAT_TXDAT_Pos         ( 0 )                                                 /*!< USPI_T::TXDAT: TXDAT Position          */
#define USPI_TXDAT_TXDAT_Msk         ( 0xfffful << USPI_TXDAT_TXDAT_Pos )                  /*!< USPI_T::TXDAT: TXDAT Mask              */

#define USPI_TXDAT_PORTDIR_Pos       ( 16 )                                                /*!< USPI_T::TXDAT: PORTDIR Position        */
#define USPI_TXDAT_PORTDIR_Msk       ( 0x1ul << USPI_TXDAT_PORTDIR_Pos )                   /*!< USPI_T::TXDAT: PORTDIR Mask            */

#define USPI_RXDAT_RXDAT_Pos         ( 0 )                                                 /*!< USPI_T::RXDAT: RXDAT Position          */
#define USPI_RXDAT_RXDAT_Msk         ( 0xfffful << USPI_RXDAT_RXDAT_Pos )                  /*!< USPI_T::RXDAT: RXDAT Mask              */

#define USPI_BUFCTL_TXUDRIEN_Pos     ( 6 )                                                 /*!< USPI_T::BUFCTL: TXUDRIEN Position      */
#define USPI_BUFCTL_TXUDRIEN_Msk     ( 0x1ul << USPI_BUFCTL_TXUDRIEN_Pos )                 /*!< USPI_T::BUFCTL: TXUDRIEN Mask          */

#define USPI_BUFCTL_TXCLR_Pos        ( 7 )                                                 /*!< USPI_T::BUFCTL: TXCLR Position         */
#define USPI_BUFCTL_TXCLR_Msk        ( 0x1ul << USPI_BUFCTL_TXCLR_Pos )                    /*!< USPI_T::BUFCTL: TXCLR Mask             */

#define USPI_BUFCTL_RXOVIEN_Pos      ( 14 )                                                /*!< USPI_T::BUFCTL: RXOVIEN Position       */
#define USPI_BUFCTL_RXOVIEN_Msk      ( 0x1ul << USPI_BUFCTL_RXOVIEN_Pos )                  /*!< USPI_T::BUFCTL: RXOVIEN Mask           */

#define USPI_BUFCTL_RXCLR_Pos        ( 15 )                                                /*!< USPI_T::BUFCTL: RXCLR Position         */
#define USPI_BUFCTL_RXCLR_Msk        ( 0x1ul << USPI_BUFCTL_RXCLR_Pos )                    /*!< USPI_T::BUFCTL: RXCLR Mask             */

#define USPI_BUFCTL_TXRST_Pos        ( 16 )                                                /*!< USPI_T::BUFCTL: TXRST Position         */
#define USPI_BUFCTL_TXRST_Msk        ( 0x1ul << USPI_BUFCTL_TXRST_Pos )                    /*!< USPI_T::BUFCTL: TXRST Mask             */

#define USPI_BUFCTL_RXRST_Pos        ( 17 )                                                /*!< USPI_T::BUFCTL: RXRST Position         */
#define USPI_BUFCTL_RXRST_Msk        ( 0x1ul << USPI_BUFCTL_RXRST_Pos )                    /*!< USPI_T::BUFCTL: RXRST Mask             */

#define USPI_BUFSTS_RXEMPTY_Pos      ( 0 )                                                 /*!< USPI_T::BUFSTS: RXEMPTY Position       */
#define USPI_BUFSTS_RXEMPTY_Msk      ( 0x1ul << USPI_BUFSTS_RXEMPTY_Pos )                  /*!< USPI_T::BUFSTS: RXEMPTY Mask           */

#define USPI_BUFSTS_RXFULL_Pos       ( 1 )                                                 /*!< USPI_T::BUFSTS: RXFULL Position        */
#define USPI_BUFSTS_RXFULL_Msk       ( 0x1ul << USPI_BUFSTS_RXFULL_Pos )                   /*!< USPI_T::BUFSTS: RXFULL Mask            */

#define USPI_BUFSTS_RXOVIF_Pos       ( 3 )                                                 /*!< USPI_T::BUFSTS: RXOVIF Position        */
#define USPI_BUFSTS_RXOVIF_Msk       ( 0x1ul << USPI_BUFSTS_RXOVIF_Pos )                   /*!< USPI_T::BUFSTS: RXOVIF Mask            */

#define USPI_BUFSTS_TXEMPTY_Pos      ( 8 )                                                 /*!< USPI_T::BUFSTS: TXEMPTY Position       */
#define USPI_BUFSTS_TXEMPTY_Msk      ( 0x1ul << USPI_BUFSTS_TXEMPTY_Pos )                  /*!< USPI_T::BUFSTS: TXEMPTY Mask           */

#define USPI_BUFSTS_TXFULL_Pos       ( 9 )                                                 /*!< USPI_T::BUFSTS: TXFULL Position        */
#define USPI_BUFSTS_TXFULL_Msk       ( 0x1ul << USPI_BUFSTS_TXFULL_Pos )                   /*!< USPI_T::BUFSTS: TXFULL Mask            */

#define USPI_BUFSTS_TXUDRIF_Pos      ( 11 )                                                /*!< USPI_T::BUFSTS: TXUDRIF Position       */
#define USPI_BUFSTS_TXUDRIF_Msk      ( 0x1ul << USPI_BUFSTS_TXUDRIF_Pos )                  /*!< USPI_T::BUFSTS: TXUDRIF Mask           */

#define USPI_PDMACTL_PDMARST_Pos     ( 0 )                                                 /*!< USPI_T::PDMACTL: PDMARST Position      */
#define USPI_PDMACTL_PDMARST_Msk     ( 0x1ul << USPI_PDMACTL_PDMARST_Pos )                 /*!< USPI_T::PDMACTL: PDMARST Mask          */

#define USPI_PDMACTL_TXPDMAEN_Pos    ( 1 )                                                 /*!< USPI_T::PDMACTL: TXPDMAEN Position     */
#define USPI_PDMACTL_TXPDMAEN_Msk    ( 0x1ul << USPI_PDMACTL_TXPDMAEN_Pos )                /*!< USPI_T::PDMACTL: TXPDMAEN Mask         */

#define USPI_PDMACTL_RXPDMAEN_Pos    ( 2 )                                                 /*!< USPI_T::PDMACTL: RXPDMAEN Position     */
#define USPI_PDMACTL_RXPDMAEN_Msk    ( 0x1ul << USPI_PDMACTL_RXPDMAEN_Pos )                /*!< USPI_T::PDMACTL: RXPDMAEN Mask         */

