FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/uspi_reg.h
#define USPI_PDMACTL_PDMAEN_Pos      ( 3 )                                                 /*!< USPI_T::PDMACTL: PDMAEN Position       */
#define USPI_PDMACTL_PDMAEN_Msk      ( 0x1ul << USPI_PDMACTL_PDMAEN_Pos )                  /*!< USPI_T::PDMACTL: PDMAEN Mask           */

#define USPI_WKCTL_WKEN_Pos          ( 0 )                                                 /*!< USPI_T::WKCTL: WKEN Position           */
#define USPI_WKCTL_WKEN_Msk          ( 0x1ul << USPI_WKCTL_WKEN_Pos )                      /*!< USPI_T::WKCTL: WKEN Mask               */

#define USPI_WKCTL_WKADDREN_Pos      ( 1 )                                                 /*!< USPI_T::WKCTL: WKADDREN Position       */
#define USPI_WKCTL_WKADDREN_Msk      ( 0x1ul << USPI_WKCTL_WKADDREN_Pos )                  /*!< USPI_T::WKCTL: WKADDREN Mask           */

#define USPI_WKCTL_PDBOPT_Pos        ( 2 )                                                 /*!< USPI_T::WKCTL: PDBOPT Position         */
#define USPI_WKCTL_PDBOPT_Msk        ( 0x1ul << USPI_WKCTL_PDBOPT_Pos )                    /*!< USPI_T::WKCTL: PDBOPT Mask             */

#define USPI_WKSTS_WKF_Pos           ( 0 )                                                 /*!< USPI_T::WKSTS: WKF Position            */
#define USPI_WKSTS_WKF_Msk           ( 0x1ul << USPI_WKSTS_WKF_Pos )                       /*!< USPI_T::WKSTS: WKF Mask                */

#define USPI_PROTCTL_SLAVE_Pos       ( 0 )                                                 /*!< USPI_T::PROTCTL: SLAVE Position        */
#define USPI_PROTCTL_SLAVE_Msk       ( 0x1ul << USPI_PROTCTL_SLAVE_Pos )                   /*!< USPI_T::PROTCTL: SLAVE Mask            */

#define USPI_PROTCTL_SLV3WIRE_Pos    ( 1 )                                                 /*!< USPI_T::PROTCTL: SLV3WIRE Position     */
#define USPI_PROTCTL_SLV3WIRE_Msk    ( 0x1ul << USPI_PROTCTL_SLV3WIRE_Pos )                /*!< USPI_T::PROTCTL: SLV3WIRE Mask         */

#define USPI_PROTCTL_SS_Pos          ( 2 )                                                 /*!< USPI_T::PROTCTL: SS Position           */
#define USPI_PROTCTL_SS_Msk          ( 0x1ul << USPI_PROTCTL_SS_Pos )                      /*!< USPI_T::PROTCTL: SS Mask               */

#define USPI_PROTCTL_AUTOSS_Pos      ( 3 )                                                 /*!< USPI_T::PROTCTL: AUTOSS Position       */
#define USPI_PROTCTL_AUTOSS_Msk      ( 0x1ul << USPI_PROTCTL_AUTOSS_Pos )                  /*!< USPI_T::PROTCTL: AUTOSS Mask           */

#define USPI_PROTCTL_SCLKMODE_Pos    ( 6 )                                                 /*!< USPI_T::PROTCTL: SCLKMODE Position     */
#define USPI_PROTCTL_SCLKMODE_Msk    ( 0x3ul << USPI_PROTCTL_SCLKMODE_Pos )                /*!< USPI_T::PROTCTL: SCLKMODE Mask         */

#define USPI_PROTCTL_SUSPITV_Pos     ( 8 )                                                 /*!< USPI_T::PROTCTL: SUSPITV Position      */
#define USPI_PROTCTL_SUSPITV_Msk     ( 0xful << USPI_PROTCTL_SUSPITV_Pos )                 /*!< USPI_T::PROTCTL: SUSPITV Mask          */

#define USPI_PROTCTL_TSMSEL_Pos      ( 12 )                                                /*!< USPI_T::PROTCTL: TSMSEL Position       */
#define USPI_PROTCTL_TSMSEL_Msk      ( 0x7ul << USPI_PROTCTL_TSMSEL_Pos )                  /*!< USPI_T::PROTCTL: TSMSEL Mask           */

#define USPI_PROTCTL_SLVTOCNT_Pos    ( 16 )                                                /*!< USPI_T::PROTCTL: SLVTOCNT Position     */
#define USPI_PROTCTL_SLVTOCNT_Msk    ( 0x3fful << USPI_PROTCTL_SLVTOCNT_Pos )              /*!< USPI_T::PROTCTL: SLVTOCNT Mask         */

#define USPI_PROTCTL_TXUDRPOL_Pos    ( 28 )                                                /*!< USPI_T::PROTCTL: TXUDRPOL Position     */
#define USPI_PROTCTL_TXUDRPOL_Msk    ( 0x1ul << USPI_PROTCTL_TXUDRPOL_Pos )                /*!< USPI_T::PROTCTL: TXUDRPOL Mask         */

#define USPI_PROTCTL_PROTEN_Pos      ( 31 )                                                /*!< USPI_T::PROTCTL: PROTEN Position       */
#define USPI_PROTCTL_PROTEN_Msk      ( 0x1ul << USPI_PROTCTL_PROTEN_Pos )                  /*!< USPI_T::PROTCTL: PROTEN Mask           */

#define USPI_PROTIEN_SSINAIEN_Pos    ( 0 )                                                 /*!< USPI_T::PROTIEN: SSINAIEN Position     */
#define USPI_PROTIEN_SSINAIEN_Msk    ( 0x1ul << USPI_PROTIEN_SSINAIEN_Pos )                /*!< USPI_T::PROTIEN: SSINAIEN Mask         */

#define USPI_PROTIEN_SSACTIEN_Pos    ( 1 )                                                 /*!< USPI_T::PROTIEN: SSACTIEN Position     */
#define USPI_PROTIEN_SSACTIEN_Msk    ( 0x1ul << USPI_PROTIEN_SSACTIEN_Pos )                /*!< USPI_T::PROTIEN: SSACTIEN Mask         */

#define USPI_PROTIEN_SLVTOIEN_Pos    ( 2 )                                                 /*!< USPI_T::PROTIEN: SLVTOIEN Position     */
#define USPI_PROTIEN_SLVTOIEN_Msk    ( 0x1ul << USPI_PROTIEN_SLVTOIEN_Pos )                /*!< USPI_T::PROTIEN: SLVTOIEN Mask         */

#define USPI_PROTIEN_SLVBEIEN_Pos    ( 3 )                                                 /*!< USPI_T::PROTIEN: SLVBEIEN Position     */
#define USPI_PROTIEN_SLVBEIEN_Msk    ( 0x1ul << USPI_PROTIEN_SLVBEIEN_Pos )                /*!< USPI_T::PROTIEN: SLVBEIEN Mask         */

#define USPI_PROTSTS_TXSTIF_Pos      ( 1 )                                                 /*!< USPI_T::PROTSTS: TXSTIF Position       */
#define USPI_PROTSTS_TXSTIF_Msk      ( 0x1ul << USPI_PROTSTS_TXSTIF_Pos )                  /*!< USPI_T::PROTSTS: TXSTIF Mask           */

#define USPI_PROTSTS_TXENDIF_Pos     ( 2 )                                                 /*!< USPI_T::PROTSTS: TXENDIF Position      */
#define USPI_PROTSTS_TXENDIF_Msk     ( 0x1ul << USPI_PROTSTS_TXENDIF_Pos )                 /*!< USPI_T::PROTSTS: TXENDIF Mask          */

#define USPI_PROTSTS_RXSTIF_Pos      ( 3 )                                                 /*!< USPI_T::PROTSTS: RXSTIF Position       */
#define USPI_PROTSTS_RXSTIF_Msk      ( 0x1ul << USPI_PROTSTS_RXSTIF_Pos )                  /*!< USPI_T::PROTSTS: RXSTIF Mask           */

#define USPI_PROTSTS_RXENDIF_Pos     ( 4 )                                                 /*!< USPI_T::PROTSTS: RXENDIF Position      */
#define USPI_PROTSTS_RXENDIF_Msk     ( 0x1ul << USPI_PROTSTS_RXENDIF_Pos )                 /*!< USPI_T::PROTSTS: RXENDIF Mask          */

