FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/uspi_reg.h
#define USPI_PROTSTS_SLVTOIF_Pos     ( 5 )                                                 /*!< USPI_T::PROTSTS: SLVTOIF Position      */
#define USPI_PROTSTS_SLVTOIF_Msk     ( 0x1ul << USPI_PROTSTS_SLVTOIF_Pos )                 /*!< USPI_T::PROTSTS: SLVTOIF Mask          */

#define USPI_PROTSTS_SLVBEIF_Pos     ( 6 )                                                 /*!< USPI_T::PROTSTS: SLVBEIF Position      */
#define USPI_PROTSTS_SLVBEIF_Msk     ( 0x1ul << USPI_PROTSTS_SLVBEIF_Pos )                 /*!< USPI_T::PROTSTS: SLVBEIF Mask          */

#define USPI_PROTSTS_SSINAIF_Pos     ( 8 )                                                 /*!< USPI_T::PROTSTS: SSINAIF Position      */
#define USPI_PROTSTS_SSINAIF_Msk     ( 0x1ul << USPI_PROTSTS_SSINAIF_Pos )                 /*!< USPI_T::PROTSTS: SSINAIF Mask          */

#define USPI_PROTSTS_SSACTIF_Pos     ( 9 )                                                 /*!< USPI_T::PROTSTS: SSACTIF Position      */
#define USPI_PROTSTS_SSACTIF_Msk     ( 0x1ul << USPI_PROTSTS_SSACTIF_Pos )                 /*!< USPI_T::PROTSTS: SSACTIF Mask          */

#define USPI_PROTSTS_SSLINE_Pos      ( 16 )                                                /*!< USPI_T::PROTSTS: SSLINE Position       */
#define USPI_PROTSTS_SSLINE_Msk      ( 0x1ul << USPI_PROTSTS_SSLINE_Pos )                  /*!< USPI_T::PROTSTS: SSLINE Mask           */

#define USPI_PROTSTS_BUSY_Pos        ( 17 )                                                /*!< USPI_T::PROTSTS: BUSY Position         */
#define USPI_PROTSTS_BUSY_Msk        ( 0x1ul << USPI_PROTSTS_BUSY_Pos )                    /*!< USPI_T::PROTSTS: BUSY Mask             */

#define USPI_PROTSTS_SLVUDR_Pos      ( 18 )                                                /*!< USPI_T::PROTSTS: SLVUDR Position       */
#define USPI_PROTSTS_SLVUDR_Msk      ( 0x1ul << USPI_PROTSTS_SLVUDR_Pos )                  /*!< USPI_T::PROTSTS: SLVUDR Mask           */

/**@}*/ /* USPI_CONST */
/**@}*/ /* end of USPI register group */
/**@}*/ /* end of REGISTER group */


#endif /* __USPI_REG_H__ */
